Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetBase.Attributes Property
 Gets or sets the dimension set attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionSetBaseAttributes Attributes { get; set; }
Public Property Attributes As DimensionSetBaseAttributes
	Get
	Set
Property Value
Type: DimensionSetBaseAttributes
See Also
Reference
CurvedDimensionSetBase Class
Tekla.Structures.Drawing Namespace